# Lendo dados

In [ ]:
import pandas as pd

df_csv = pd.read_csv("pokemon_data.csv")

Já vimos o básico sobre isso no tópico anterior, vamos ver mais coisas nesse agora.

A primeira coisa é ver o nome das colunas.

In [10]:
df_csv.columns

Index(['#', 'Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense', 'Sp. Atk',
       'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [11]:
df_csv.columns.values

array(['#', 'Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense',
       'Sp. Atk', 'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype=object)

Ver os dados da coluna que quisermos. Existem algumas formas de fazermos isso.

In [2]:
df_csv[['Name','Attack','Defense']]

                      Name  Attack  Defense
0                Bulbasaur      49       49
1                  Ivysaur      62       63
2                 Venusaur      82       83
3    VenusaurMega Venusaur     100      123
4               Charmander      52       43
..                     ...     ...      ...
795                Diancie     100      150
796    DiancieMega Diancie     160      110
797    HoopaHoopa Confined     110       60
798     HoopaHoopa Unbound     160       60
799              Volcanion     110      120

[800 rows x 3 columns]

In [3]:
df_csv[['Name','Attack','Defense']][15:20]

                     Name  Attack  Defense
15             Butterfree      45       50
16                 Weedle      35       30
17                 Kakuna      25       50
18               Beedrill      90       40
19  BeedrillMega Beedrill     150       40

Ler as linhas que quisermos, elas inteiras ou so escolhendo um intervalo das colunas

In [19]:
df_csv[0:10]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,44,48,65,50,64,43,1,False

In [15]:
df_csv.iloc[3:6, 5:7]

   Attack  Defense
3     100      123
4      52       43
5      64       58

Ler um elemento em específico. linha x coluna, como em matrizes.

In [6]:
df_csv.iloc[3,5]

100

Pegar todas ou agumas informações de uma linha e colocala na vertical.

In [7]:
ind = int(input("Digite o índice da linha: "))

for index, row in df_csv.iterrows():
    
    if index == ind:
        print(index, row)
        break

42 #                 37
Name          Vulpix
Type 1          Fire
Type 2           NaN
HP                38
Attack            41
Defense           40
Sp. Atk           50
Sp. Def           65
Speed             65
Generation         1
Legendary      False
Name: 42, dtype: object

In [8]:
ind = int(input("Digite o índice da linha: "))

for index, row in df_csv.iterrows():
    
    if index == ind:
        print(index, row[1:6])
        break

6 Name      Charizard
Type 1         Fire
Type 2       Flying
HP               78
Attack           84
Name: 6, dtype: object